# Rolling sum salary

Source: https://towardsdatascience.com/twenty-five-sql-practice-exercises-5fc791e24082

The following table shows the monthly salary for an employee for the first nine months in a given year. From this, write a query to return a table that displays, for each month in the first half of the year, the rolling sum of the employeeâ€™s salary for that month and the following two months, ordered chronologically.

In [1]:
%run Question_27_RollingSumSalary.ipynb

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
9 rows affected.
9 rows affected.

## The solution is given below

In [2]:
%%sql

-- self-join to match month n with months n, n+1, and n+2, then sum
-- salary across those months, filter to first half of year, and sort

SELECT s1.month, sum(s2.salary) AS salary_3mos FROM salaries s1
JOIN salaries s2
ON s1.month <= s2.month
AND s1.month > s2.month - 3 GROUP BY 1
HAVING s1.month < 7
ORDER BY 1 ASC;

 * postgresql://fknight:***@localhost/postgres
6 rows affected.

[(1, '$10,000.00'),
 (2, '$12,000.00'),
 (3, '$11,000.00'),
 (4, '$7,000.00'),
 (5, '$5,000.00'),
 (6, '$7,000.00')]